decnextPage3.addEventListener('click', () => {
    document.body.classList.add('fadeOut.hide');
    setTimeout(() => {
        Page3.style.display = 'none';
        textsContainer.style.display = 'block';
        showText();
    }, 500);
});
const btn2 = document.getElementById("decnextPage2");
btn2.addEventListener("click", () => {
    window.location.href = 'search.html';
});


function clickbtn() {
    let rangeInput2 = document.getElementById("myRange").value;
    rangeInput2 = rangeInput2 * 1;

    if (rangeInput2 > 0) {
        const textCategories2 = {
            Pos: [
                '.گیاهان تغیییر ژنتیک یافته به دلیل استفاده ی کمتر از افت کش ها در روند کشت، مفید هستند.',
                '.غذاهای تغییر ژنتیک یافته به علت پیشگیری از  بروز عکس العمل آلرژیک مفید هستند.',
                '.اصلاح نژاد  محصولات، مفید بوده و تأثیر مثبت بر عرضه مواد غذایی دارند چرا که برای مدت طولانی تری تازه میمانند.',
                '.محصولات تغییر ژنتیک یافته نه تنها از نظر ارزش غذایی مفید بوده بلکه طعم بهتری دارند.',
                '.یکسری از فواید محصولات تغییر ژنتیک یافته این است که کشت این محصولات می‌تواند منجر به تاثیرات مثبتی بر محیط زیست شود.',
                '.از آنجایی که ارزش غذایی محصولات تغییر ژنتیک یافته با غذاهای معمولی تقریبا برابر است وجود این محصولات در سبد غذایی مصرف کننده مفید است.',
                '.غذاهای تغییر ژنتیک یافته  نه تنها برای سلامت انسان آسیب رسان نیستند بلکه مفید نیز هستند.',
                '.مواد غذایی تغییر ژنتیک یافته در عین مفید بودن از تنوع غذایی بیشتری برخوردار هستند.',
                '.غذاهای تغییر ژنتیک یافته به سبب داشتن ارزش غذایی بالا برای سلامت جامعه مفید بود و عواقب بلند مدتی را در پی ندارند.',
                '.گیاهان تغییر ژنتیک یافته سبب تولید محصولات غذایی مفیدی میشوند که عمر بیشتری هم دارند.',
                '.گیاهان تغییر ژنتیک یافته داراری ویتامین ها و مواد مغذی بیشتری بوده و در نتیجه مفید تر هستند.',
                '.یکی از فواید گیاهان تغییر ژنتیک یافته این است که نسبت  به آسیب  حشرات مقاوم هستند.',
                '.محصولات تغییر ژنتیک یافته مفید بوده و می‌توانند به کشاورزان کوچک اجازه دهند تا با شرایط دشوار محیطی و اقتصادی، بهتر مقابله کنند.',
                '.از جمله فواید گیاهان تغییر ژنتیک یافته این است که با استفاده از کود و آب کمتر، هزینه‌ ی تولید کمتری  هم دارند',
                '.استفاده از گیاهان تغییر ژنتیک یافته به دلیل مقاومت به دماهای بالا مفید است.',
            ],

            Neg: [
                'مقاومت گیاهان تغییر ژنتیک یافته نسبت به آفت کش ها باعث استفاده ی بیش از حد از این مواد سمی در فرایند کشت شده که بسیار مضر هستند.',
                'محصولات تغییر ژنتیک یافته تحت انحصار شرکت‌های بزرگ هستند که این امر می‌تواند بر روی کشاورزان کوچک و جوامع محلی تأثیر مضری بگذارد.',
                'غذاهای تغییر یافته ژنتیکی میتوانند ویژگی های سمی و مضری داشته باشند.',
                'عکس العمل های آلرژیتیک از عوارض مضر غذاهای تغییر یافته ژنتیکی است.',
                'از جمله ضرر های غذاهای تغییر ژنتیک یافته  این است که تنوع زیستی را کاهش داده و به اکوسیستم آسیب میرساند.',
                'غذاهای تغییر ژنتیک یافته باعث میشود بدن نسبت به آنتی بیوتیک ها مقاومت داشته  و در نتیجه مضر هستند.',
                'غذاهای تغییر ژنتیک یافته مضر بوده و سبب سرکوب سیستم ایمنی می شوند.',
                'سرطان می تواند از عوارض بلند مدت و مضر غذاهای تغییر ژنتیک یافته باشد.',
                'ارزش غذایی برخی غذاهای اصلاح شده کمتر از نمونه طبیعی آن بوده و حتی در برخی موارد مضر هستند.',
                'گیاهان تغییر ژنتیک یافته سبب انتشار سموم در خاک می شود که مضر است.',
                'غذاهای تغییر ژنتیک یافته به دلیل ایجاد اختلال در تنوع زیستی مضر بوده و ایجاد گونه های جدید غیرمنتظر  را سبب میشود.',
                'از جمله ضرر های غذاهای تغییر ژنتیک یافته ، آسیب رساندن به حیوانات و موجودات زنده است زیرا احتمال به وجود آوردن  بیماریهایی خطرناک را در پی دارد.',
                'تغییرات در دی ان ای انسان می تواند از عوارض مضر بلند مدت غذاهای تغییر ژنتیک یافته باشد.',
                'غذاهای تغییر ژنتیک یافته اثرات غیر منتظره ی مضری را می تواند به دنبال داشته باشد.',
                'گیاهان تغییر ژنتیک یافته سبب افزایش استفاده از سمومی مانند حشره کش ها می شوند که برای سلامت انسان مضر هستند.'
            ],


        };


        const textEl = document.getElementById('text');
        const remainingEl = document.getElementById('remaining');
        const nextButton = document.getElementById('nextButton');

        // تابع shuffle برای مرتب‌سازی تصادفی یک آرایه
        function shuffle(array) {
            for (let i = array.length - 1; i > 0; i--) {
                const j = Math.floor(Math.random() * (i + 1));
                [array[i], array[j]] = [array[j], array[i]];
            }
            return array;
        }

        let shuffledNegTexts = shuffle([...textCategories2.Neg]);
        let initialNegTexts = shuffledNegTexts.splice(0, 9); // 9 متن اول از دسته "Neg"
        let remainingNegTexts = shuffledNegTexts; // مابقی متون دسته "Neg"
        let shuffledPosTexts = shuffle([...textCategories2.Pos]).splice(0, 15); // 15 متن از دسته "Pos"

        let combinedTexts = shuffle([...remainingNegTexts, ...shuffledPosTexts]); // ترکیب و مرتب‌سازی تصادفی

        let textsToShow = [...initialNegTexts, ...combinedTexts]; // ترکیب دو مرحله

        nextButton.addEventListener('click', showNextText);

        function showNextText() {
            // 		// فعال کردن دکمه دیسیبل
            // // nextButton.setAttribute('disabled', true);

            // // // تنظیم شفافیت ابتدایی دکمه
            // // nextButton.style.opacity = '0.5';

            // // // تنظیم ترانزیشن CSS برای تغییر شفافیت دکمه
            // // nextButton.style.transition = 'opacity 0.5s ease';

            // // // انتظار 5 ثانیه و سپس فعال کردن دوباره دکمه با تغییر شفافیت به 1
            // // setTimeout(() => {
            // //   nextButton.removeAttribute('disabled');
            // //   nextButton.style.opacity = '1';
            // // }, 1000);
            if (textsToShow.length > 0) {
                const nextText = textsToShow.shift(); // گرفتن متن بعدی
                textEl.innerText = nextText;
                remainingEl.innerText = `${textsToShow.length}`; // به‌روزرسانی تعداد باقی‌مانده
            } else {
                document.getElementById("textsContainer").style.display = "none";
                document.getElementById("page2").style.display = "block";
            }
        }

        // نمایش اولین متن
        showNextText();


    } else if (rangeInput2 < 0) {
        const textCategories2 = {
            Neg: [
                'مقاومت گیاهان تغییر ژنتیک یافته نسبت به آفت کش ها باعث استفاده ی بیش از حد از این مواد سمی در فرایند کشت شده که بسیار مضر هستند.',
                'محصولات تغییر ژنتیک یافته تحت انحصار شرکت‌های بزرگ هستند که این امر می‌تواند بر روی کشاورزان کوچک و جوامع محلی تأثیر مضری بگذارد.',
                'غذاهای تغییر یافته ژنتیکی میتوانند ویژگی های سمی و مضری داشته باشند.',
                'عکس العمل های آلرژیتیک از عوارض مضر غذاهای تغییر یافته ژنتیکی است.',
                'از جمله ضرر های غذاهای تغییر ژنتیک یافته  این است که تنوع زیستی را کاهش داده و به اکوسیستم آسیب میرساند.',
                'غذاهای تغییر ژنتیک یافته باعث میشود بدن نسبت به آنتی بیوتیک ها مقاومت داشته  و در نتیجه مضر هستند.',
                'غذاهای تغییر ژنتیک یافته مضر بوده و سبب سرکوب سیستم ایمنی می شوند.',
                'سرطان می تواند از عوارض بلند مدت و مضر غذاهای تغییر ژنتیک یافته باشد.',
                'ارزش غذایی برخی غذاهای اصلاح شده کمتر از نمونه طبیعی آن بوده و حتی در برخی موارد مضر هستند.',
                'گیاهان تغییر ژنتیک یافته سبب انتشار سموم در خاک می شود که مضر است.',
                'غذاهای تغییر ژنتیک یافته به دلیل ایجاد اختلال در تنوع زیستی مضر بوده و ایجاد گونه های جدید غیرمنتظر  را سبب میشود.',
                'از جمله ضرر های غذاهای تغییر ژنتیک یافته ، آسیب رساندن به حیوانات و موجودات زنده است زیرا احتمال به وجود آوردن  بیماریهایی خطرناک را در پی دارد.',
                'تغییرات در دی ان ای انسان می تواند از عوارض مضر بلند مدت غذاهای تغییر ژنتیک یافته باشد.',
                'غذاهای تغییر ژنتیک یافته اثرات غیر منتظره ی مضری را می تواند به دنبال داشته باشد.',
                'گیاهان تغییر ژنتیک یافته سبب افزایش استفاده از سمومی مانند حشره کش ها می شوند که برای سلامت انسان مضر هستند.'
            ],

            Pos: [
                '.گیاهان تغیییر ژنتیک یافته به دلیل استفاده ی کمتر از افت کش ها در روند کشت، مفید هستند.',
                '.غذاهای تغییر ژنتیک یافته به علت پیشگیری از  بروز عکس العمل آلرژیک مفید هستند.',
                '.اصلاح نژاد  محصولات، مفید بوده و تأثیر مثبت بر عرضه مواد غذایی دارند چرا که برای مدت طولانی تری تازه میمانند.',
                '.محصولات تغییر ژنتیک یافته نه تنها از نظر ارزش غذایی مفید بوده بلکه طعم بهتری دارند.',
                '.یکسری از فواید محصولات تغییر ژنتیک یافته این است که کشت این محصولات می‌تواند منجر به تاثیرات مثبتی بر محیط زیست شود.',
                '.از آنجایی که ارزش غذایی محصولات تغییر ژنتیک یافته با غذاهای معمولی تقریبا برابر است وجود این محصولات در سبد غذایی مصرف کننده مفید است.',
                '.غذاهای تغییر ژنتیک یافته  نه تنها برای سلامت انسان آسیب رسان نیستند بلکه مفید نیز هستند.',
                '.مواد غذایی تغییر ژنتیک یافته در عین مفید بودن از تنوع غذایی بیشتری برخوردار هستند.',
                '.غذاهای تغییر ژنتیک یافته به سبب داشتن ارزش غذایی بالا برای سلامت جامعه مفید بود و عواقب بلند مدتی را در پی ندارند.',
                '.گیاهان تغییر ژنتیک یافته سبب تولید محصولات غذایی مفیدی میشوند که عمر بیشتری هم دارند.',
                '.گیاهان تغییر ژنتیک یافته داراری ویتامین ها و مواد مغذی بیشتری بوده و در نتیجه مفید تر هستند.',
                '.یکی از فواید گیاهان تغییر ژنتیک یافته این است که نسبت  به آسیب  حشرات مقاوم هستند.',
                '.محصولات تغییر ژنتیک یافته مفید بوده و می‌توانند به کشاورزان کوچک اجازه دهند تا با شرایط دشوار محیطی و اقتصادی، بهتر مقابله کنند.',
                '.از جمله فواید گیاهان تغییر ژنتیک یافته این است که با استفاده از کود و آب کمتر، هزینه‌ ی تولید کمتری  هم دارند',
                '.استفاده از گیاهان تغییر ژنتیک یافته به دلیل مقاومت به دماهای بالا مفید است.',
            ],


        };


        const textEl = document.getElementById('text');
        const remainingEl = document.getElementById('remaining');
        const nextButton = document.getElementById('nextButton');

        // تابع shuffle برای مرتب‌سازی تصادفی یک آرایه
        function shuffle(array) {
            for (let i = array.length - 1; i > 0; i--) {
                const j = Math.floor(Math.random() * (i + 1));
                [array[i], array[j]] = [array[j], array[i]];
            }
            return array;
        }

        let shuffledNegTexts = shuffle([...textCategories2.Pos]);
        let initialNegTexts = shuffledNegTexts.splice(0, 9); // 9 متن اول از دسته "Neg"
        let remainingNegTexts = shuffledNegTexts; // مابقی متون دسته "Neg"
        let shuffledPosTexts = shuffle([...textCategories2.Neg]).splice(0, 15); // 15 متن از دسته "Pos"

        let combinedTexts = shuffle([...remainingNegTexts, ...shuffledPosTexts]); // ترکیب و مرتب‌سازی تصادفی

        let textsToShow = [...initialNegTexts, ...combinedTexts]; // ترکیب دو مرحله

        nextButton.addEventListener('click', showNextText);

        function showNextText() {
            // 		// فعال کردن دکمه دیسیبل
            // // nextButton.setAttribute('disabled', true);

            // // // تنظیم شفافیت ابتدایی دکمه
            // // nextButton.style.opacity = '0.5';

            // // // تنظیم ترانزیشن CSS برای تغییر شفافیت دکمه
            // // nextButton.style.transition = 'opacity 0.5s ease';

            // // // انتظار 5 ثانیه و سپس فعال کردن دوباره دکمه با تغییر شفافیت به 1
            // // setTimeout(() => {
            // //   nextButton.removeAttribute('disabled');
            // //   nextButton.style.opacity = '1';
            // // }, 1000);
            if (textsToShow.length > 0) {
                const nextText = textsToShow.shift(); // گرفتن متن بعدی
                textEl.innerText = nextText;
                remainingEl.innerText = `${textsToShow.length}`; // به‌روزرسانی تعداد باقی‌مانده
            } else {
                document.getElementById("textsContainer").style.display = "none";
                document.getElementById("page2").style.display = "block";
            }
        }
        // نمایش اولین متن
        showNextText();

    } else if (rangeInput2 == 0) {
        const textCategories = {
            Neg: [
                // '16', '17', '18', '19', '20', '21', '22', '23', '24',
                // '25', '26', '27', '28', '29', '30',
                'مقاومت گیاهان تغییر ژنتیک یافته نسبت به آفت کش ها باعث استفاده ی بیش از حد از این مواد سمی در فرایند کشت شده که بسیار مضر هستند.',
                'محصولات تغییر ژنتیک یافته تحت انحصار شرکت‌های بزرگ هستند که این امر می‌تواند بر روی کشاورزان کوچک و جوامع محلی تأثیر مضری بگذارد.',
                'غذاهای تغییر یافته ژنتیکی میتوانند ویژگی های سمی و مضری داشته باشند.',
                'عکس العمل های آلرژیتیک از عوارض مضر غذاهای تغییر یافته ژنتیکی است.',
                'از جمله ضرر های غذاهای تغییر ژنتیک یافته  این است که تنوع زیستی را کاهش داده و به اکوسیستم آسیب میرساند.',
                'غذاهای تغییر ژنتیک یافته باعث میشود بدن نسبت به آنتی بیوتیک ها مقاومت داشته  و در نتیجه مضر هستند.',
                'غذاهای تغییر ژنتیک یافته مضر بوده و سبب سرکوب سیستم ایمنی می شوند.',
                'سرطان می تواند از عوارض بلند مدت و مضر غذاهای تغییر ژنتیک یافته باشد.',
                'ارزش غذایی برخی غذاهای اصلاح شده کمتر از نمونه طبیعی آن بوده و حتی در برخی موارد مضر هستند.',
                'گیاهان تغییر ژنتیک یافته سبب انتشار سموم در خاک می شود که مضر است.',
                'غذاهای تغییر ژنتیک یافته به دلیل ایجاد اختلال در تنوع زیستی مضر بوده و ایجاد گونه های جدید غیرمنتظر  را سبب میشود.',
                'از جمله ضرر های غذاهای تغییر ژنتیک یافته ، آسیب رساندن به حیوانات و موجودات زنده است زیرا احتمال به وجود آوردن  بیماریهایی خطرناک را در پی دارد.',
                'تغییرات در دی ان ای انسان می تواند از عوارض مضر بلند مدت غذاهای تغییر ژنتیک یافته باشد.',
                'غذاهای تغییر ژنتیک یافته اثرات غیر منتظره ی مضری را می تواند به دنبال داشته باشد.',
                'گیاهان تغییر ژنتیک یافته سبب افزایش استفاده از سمومی مانند حشره کش ها می شوند که برای سلامت انسان مضر هستند.'
        
            ],
            Pos: [
                // '1', '2', '3', '4', '5', '6', '7', '8', '9',
                // '10', '11', '12', '13', '14', '15',
                '.گیاهان تغیییر ژنتیک یافته به دلیل استفاده ی کمتر از افت کش ها در روند کشت، مفید هستند.',
                '.غذاهای تغییر ژنتیک یافته به علت پیشگیری از  بروز عکس العمل آلرژیک مفید هستند.',
                '.اصلاح نژاد  محصولات، مفید بوده و تأثیر مثبت بر عرضه مواد غذایی دارند چرا که برای مدت طولانی تری تازه میمانند.',
                '.محصولات تغییر ژنتیک یافته نه تنها از نظر ارزش غذایی مفید بوده بلکه طعم بهتری دارند.',
                '.یکسری از فواید محصولات تغییر ژنتیک یافته این است که کشت این محصولات می‌تواند منجر به تاثیرات مثبتی بر محیط زیست شود.',
                '.از آنجایی که ارزش غذایی محصولات تغییر ژنتیک یافته با غذاهای معمولی تقریبا برابر است وجود این محصولات در سبد غذایی مصرف کننده مفید است.',
                '.غذاهای تغییر ژنتیک یافته  نه تنها برای سلامت انسان آسیب رسان نیستند بلکه مفید نیز هستند.',
                '.مواد غذایی تغییر ژنتیک یافته در عین مفید بودن از تنوع غذایی بیشتری برخوردار هستند.',
                '.غذاهای تغییر ژنتیک یافته به سبب داشتن ارزش غذایی بالا برای سلامت جامعه مفید بود و عواقب بلند مدتی را در پی ندارند.',
                '.گیاهان تغییر ژنتیک یافته سبب تولید محصولات غذایی مفیدی میشوند که عمر بیشتری هم دارند.',
                '.گیاهان تغییر ژنتیک یافته داراری ویتامین ها و مواد مغذی بیشتری بوده و در نتیجه مفید تر هستند.',
                '.یکی از فواید گیاهان تغییر ژنتیک یافته این است که نسبت  به آسیب  حشرات مقاوم هستند.',
                '.محصولات تغییر ژنتیک یافته مفید بوده و می‌توانند به کشاورزان کوچک اجازه دهند تا با شرایط دشوار محیطی و اقتصادی، بهتر مقابله کنند.',
                '.از جمله فواید گیاهان تغییر ژنتیک یافته این است که با استفاده از کود و آب کمتر، هزینه‌ ی تولید کمتری  هم دارند',
                '.استفاده از گیاهان تغییر ژنتیک یافته به دلیل مقاومت به دماهای بالا مفید است.',
        
            ],
        };
        function shuffle(array) {
            for (let i = array.length - 1; i > 0; i--) {
                const j = Math.floor(Math.random() * (i + 1));
                [array[i], array[j]] = [array[j], array[i]];
            }
            return array;
        }
        
        let selectedCategories = Math.random() < 0.5 ? 'Pos' : 'Neg';
        let selectedTexts, remainingTexts;
        
        if (selectedCategories === 'Pos') {
            selectedTexts = shuffle(textCategories.Pos).slice(0, 9);
            remainingTexts = shuffle([...textCategories.Neg, ...textCategories.Pos.slice(9)]);
        } else {
            selectedTexts = shuffle(textCategories.Neg).slice(0, 15);
            remainingTexts = shuffle([...textCategories.Pos, ...textCategories.Neg.slice(15)]);
        }
        
        let allTexts = [...selectedTexts, ...remainingTexts];
        
        localStorage.setItem('selectedCategories', selectedCategories);
        
        const textEl = document.getElementById('text');
        const remainingEl = document.getElementById('remaining');
        const nextButton = document.getElementById('nextButton');
        
        nextButton.addEventListener('click', showNextText);
        let firstDisplayedText;
        let firstTextSaved = false;
        
        function showNextText() {
            // 	// فعال کردن دکمه دیسیبل
            // // nextButton.setAttribute('disabled', true);

            // // // تنظیم شفافیت ابتدایی دکمه
            // // nextButton.style.opacity = '0.5';

            // // تنظیم ترانزیشن CSS برای تغییر شفافیت دکمه
            // // nextButton.style.transition = 'opacity 0.5s ease';

            // // انتظار 5 ثانیه و سپس فعال کردن دوباره دکمه با تغییر شفافیت به 1
            // // setTimeout(() => {
            // //   nextButton.removeAttribute('disabled');
            // //   nextButton.style.opacity = '1';
            // // }, 1000);
            if (allTexts.length > 0) {
                const nextText = allTexts.shift();
                textEl.innerText = nextText;
                remainingEl.innerText = `${allTexts.length}`;
                if (!firstTextSaved) {
                    firstDisplayedText = nextText;
                    firstTextSaved = true;
                    let status = "";
        
                    localStorage.setItem('firstDisplayedText', firstDisplayedText);
                    if (textCategories[selectedCategories].includes(firstDisplayedText)) {
                        status = selectedCategories === 'Neg' ? "-" : "+";
                        localStorage.setItem('status', status);
                    }
                }
            } else {
                document.getElementById("textsContainer").style.display = "none";
                document.getElementById("page2").style.display = "block";
            }
        }
        
        showNextText();
   }

}